[
  {
    "title": "Job Portal",
    "imageSrc": "projects/project1.jpeg",
    "description": "Job Portal is a full-stack web application designed to connect job seekers with employers, built using React.js for the front end and Spring Boot for the back end. It features a user-friendly interface where job seekers can browse and apply for jobs, while employers can post job listings and manage applications. The platform includes secure user authentication, role-based access control, and real-time form validation. RESTful APIs built with Spring Boot handle all backend logic and database interactions, ensuring smooth and scalable performance. This project showcases seamless integration between a modern React UI and a robust Java-based backend, providing a comprehensive solution for job management and recruitment.",
    "link": "https://github.com/sauravsingh003/JobPortal"
  },
  {
    "title": "Doctor Appointment System",
    "imageSrc": "projects/project2.png",
    "description": "The Online Doctor Appointment System is a full-stack web application built using React.js for the frontend, Spring Boot for the backend, and MySQL as the database. It allows patients to book appointments with doctors seamlessly through a responsive and intuitive interface. Features include secure user registration and login with JWT-based authentication, doctor profile listings with specialization filters, and real-time appointment scheduling. The admin panel enables management of doctors, patients, and appointment records. This project demonstrates strong integration of modern technologies, secure session handling, and effective front-end to back-end communication via REST APIs.",
    "link": "https://github.com/sauravsingh003/doctor-appointment-system"
  },
  {
    "title": "bookStore",
    "imageSrc": "projects/project3.jpeg",
    "description": "The BookStore is a full-stack web application developed using the MERN stack—MongoDB, Express.js, React.js, and Node.js. It allows users to browse, search, and purchase books through a clean and responsive interface. The application includes features such as user authentication with JWT, a dynamic search and filtering system, a detailed book information page. In this an admin panel is also implemented to manage books, including adding, editing, and deleting entries. Additionally, system enabling both users and administrators to track and handle orders efficiently. The project demonstrates strong integration between front-end and back-end technologies, efficient use of RESTful APIs, and a focus on delivering a seamless user experience.",
    "link": "https://github.com/sauravsingh003/bookStore"
  },
  {
    "title": "FitTrack",
    "imageSrc": "projects/project5.jpeg",
    "description": "FitTrack is a full-stack web application designed to help users monitor and improve their fitness journey online. Built using the MERN stack (MongoDB, Express.js, React.js, Node.js), it features secure JWT-based authentication, intuitive workout logging, and insightful analytics such as weekly performance tracking and category-wise calorie burn. The frontend is styled with Tailwind CSS and managed with Redux Toolkit for smooth and responsive state handling. Additional features include embedded workout tutorials videos, fitness blogs, and a clean, mobile-friendly and responsive UI. FitTrack offers a comprehensive platform for users to log workouts, visualize progress, and stay motivated throughly. I developed this project from scratch, focusing on both backend architecture and a polished user experience.",
    "link": "https://github.com/sauravsingh003/FitTrack"
  }
]
